#include <iostream>
#include <Windows.h>
using namespace std;


int main()

{
	SetConsoleOutputCP(1251);
	SetConsoleCP(1251);

	/*
	Завдання 1
	Пользователь вводит с клавиатуры целое шестизначное
число. Написать программу, которая определяет, является ли
введенное число — счастливым (Счастливым считается шестизначное число, у которого сумма первых 3 цифр равна сумме
вторых трех цифр). Если пользователь ввел не шестизначное
число — сообщение об ошибке.*/

	/*
	завдання 2
	Пользователь вводит четырехзначное число. Необходимо
поменять в этом числе 1 и 2 цифры, а также 3 и 4 цифры. Если
пользователь вводит не четырехзначное число — вывести
сообщение об ошибке.*/

	/*int chislo1, ch2, ch3, ch4;

	cout << "Ведіть першу цифру чотирьохзначного числа : ";
	cin >> chislo1;
	cout << "Ведіть другу цифру чотирьохзначного числа : ";
	cin >> ch2;
	cout << "Ведіть третю цифру чотирьохзначного числа : ";
	cin >> ch3;
	cout << "Ведіть четверту цифру чотирьохзначного числа : ";
	cin >> ch4;
	cout << "Ваше чиcло = " << chislo1 << ch2 << ch3 << ch4; cout << "\n";
	cout << "Результат : "<<ch2<<chislo1<<ch4<<ch3;*/
	
	/*if (chislo1 / 1000 < 1)
	{
		cout << "Ви ввели не чотрирьох значне число!!!";
	}
	else if (chislo1 / 1000 > 5)
	{
		cout << "Ви ввели не чотрирьох значне число!!!";
	}
	*/
	/*Завдання 3
	Пользователь вводит с клавиатуры 7 целых чисел. Напишите
программу, которая определяет максимальное из этих 7 чисел.
	*/
	/*
	int ch1, ch2, ch3, ch4, ch5, ch6, ch7,max;

	cout << "Введіть 1-ше ціле число : ";
	cin >> ch1;
	cout << "Введіть 2-ге ціле число : ";
	cin >> ch2;
	cout << "Введіть 3-тє ціле число : ";
	cin >> ch3;
	cout << "Введіть 4-те ціле число : ";
	cin >> ch4;
	cout << "Введіть 5-те ціле число : ";
	cin >> ch5;
	cout << "Введіть 6-те ціле число : ";
	cin >> ch6;
	cout << "Введіть 7-ме ціле число : ";
	cin >> ch7;

	if (ch1>ch2)
	{
		max = ch1;
	}
	else
	{
		max = ch2;
	}
	if (ch3>max)
	{
		max = ch3;
	}
	if (ch4>max)
	{
		max = ch4;
	}
	if (ch5>max)
	{
		max = ch5;
	}
	if (ch6>max)
	{
		max = ch6;
	}
	if (ch7>max)
	{
		max = ch7;
	}
	cout<<"Максимальне число яке Ви ввели = " << max;
	
	*/

	/*Завдання 4
	Грузовой самолет должен пролететь с грузом из пункта А
в пункт С через пункт В. Емкость бака для топлива у самолета — 300 литров. Потребление топлива на 1 км в 
зависимости
от веса груза у самолета следующее:
■ до 500 кг — 1 литров/км;
■ до 1000 кг — 4 литров/км;
■ до 1500 кг — 7 литров/км;
■ до 2000 кг — 9 литров/км;
■ более 2000 кг — самолет не поднимает.
Пользователь вводит расстояние между пунктами А и В,
и расстояние между пунктами В и С, а также вес груза. Программа должна рассчитать какое минимальное количество
топлива необходимо для дозаправки самолету в пункте В,
чтобы долететь из пункта А в пункт С. В случае невозможности преодолеть любое из расстояний — программа должна
вывести сообщение о невозможности полета по введенному
маршруту.*/
	/*
	int S1, S2, Ves;
	int fuel{};
	const int toplivo = 300;

	cout << "Ознайомтесь з вантажопідйомныстю літака та витратою пального на 1 км : \n";
	cout << "До 500 кг — 1 л/км\n";
	cout << "До 1000 кг — 4 л/км\n";
	cout << "До 1500 кг — 7 л/ км\n";
	cout << "До 2000 кг — 9 / км \n";
	cout << "Більше 2000 кг - літак не взлетить!!!\n\n";

	cout << "Введіть відстань між пункатами А та В : ";
	cin >> S1;
	cout << "Введіть відстань між пункатами B та С : ";
	cin >> S2;
	cout << "Введіть вагу груза : ";
	cin >> Ves;

	

	if (Ves<500)
	{
		fuel = toplivo - S1 + fuel; 
		cout << "Минимальна кількість палива яка потрібна для дозаправки в пункті В = " << fuel;
	}
	else if (Ves<1000)
	{
		fuel = toplivo - (S1 * 4) + fuel;
		cout << "Минимальна кількість палива яка потрібна для дозаправки в пункті В = " << fuel;
	}
	if (Ves<1500)
	{
		fuel = toplivo - (S1 * 7) + fuel;
		cout << "Минимальна кількість палива яка потрібна для дозаправки в пункті В = " << fuel;
	}
	if (Ves<2000)
	{
		fuel = toplivo - (S1 * 9) + fuel;
		cout << "Минимальна кількість палива яка потрібна для дозаправки в пункті В = " << fuel;
	}
	if (Ves>2000)
	{
		cout << "Літак не взлетить!!!";
	}

	*/
	}
